---
kind: enumMember
id: F:Autodesk.Revit.DB.CompoundStructureError.InvalidProfileId
enum: Autodesk.Revit.DB.CompoundStructureError
source: html/8e8457e0-84c4-ccb1-114c-fa25a6d37fed.htm
---
# Autodesk.Revit.DB.CompoundStructureError.InvalidProfileId

Element id used as profile id does not correspond to a valid deck profile.